package net.babichev.task2;

/**
 * Создать базовый класс со свойствами:
 *  - дальность
 *  - вместимость
 *  - скорость
 * и методами для рассчёта грузопотока в сутки в зависимости от растояния.
 *
 * Программно заполнить массив созданными объектами (разными). Размер массива 100 элементов.
 * Упорядочить масств по возрастанию стоимости перевозки и вывести элементы на экран в виде:
 *  - #
 *  - тип
 *  - наименование
 *  - дальность
 *  - вместимость
 *  - скорость
 *  - цена
 *  - цена за кг
 */

public class Main {


    public static void main(String[] args) {
    }

}
